dwgan/STKNX_ChargeStation/source/drivers/flash/STM32G0XXX/include/Stm32G0XX_Flash.h
/*******************************************************************
* (C) Copyright 2016 *********** company.
*
* File Name        : Stm32G0XX_Flash.h
*
* File Description : Header file for stm32g0xx flash definition.
*
* Other Description: No.
*
* Version          : 1.00
*
* Author           : 
*
* Data             : 2016.7.28
*
* Modification Rec.:
*   Modify Data    : 2016.7.28
*   Operator       :
*   Version        : 1.00
*   Action         : Creation.
*
********************************************************************/


#ifndef _STM32G0XX_FLASH_H_
#define _STM32G0XX_FLASH_H_

#ifdef __cplusplus
extern "C" {
#endif




/****************************************************
*   Structure£º  T_FTFA_MEM_MAP
*   Description£ºmemory map of flash management register.
*   Parameter:
*   Authour£º
*   Modify record:
*   Date:  2016-8-2 creat.
****************************************************/
typedef struct
{
    WORD32 dwAccCtrlR;          /* FLASH Access Control register,                     Address offset: 0x00 */
    WORD32 dwRESERVED1;         /* Reserved1,                                         Address offset: 0x04 */
    WORD32 dwKeyR;              /* FLASH Key register,                                Address offset: 0x08 */
    WORD32 dwOptKeyR;           /* FLASH Option Key register,                         Address offset: 0x0C */
    WORD32 dwStR;               /* FLASH Status register,                             Address offset: 0x10 */
    WORD32 dwCtrlR;             /* FLASH Control register,                            Address offset: 0x14 */
    WORD32 dwEccR;              /* FLASH ECC register,                                Address offset: 0x18 */
    WORD32 dwRESERVED2;         /* Reserved2,                                         Address offset: 0x1C */
    WORD32 dwOptByteR;          /* FLASH Option register,                             Address offset: 0x20 */
    WORD32 dwPCROP1ASR;         /* FLASH Bank PCROP area A Start address register,    Address offset: 0x24 */
    WORD32 dwPCROP1AER;         /* FLASH Bank PCROP area A End address register,      Address offset: 0x28 */
    WORD32 dwWrtPrtAR;          /* FLASH Bank WRP area A address register,            Address offset: 0x2C */
    WORD32 dwWrtPrtBR;          /* FLASH Bank WRP area B address register,            Address offset: 0x30 */
    WORD32 dwPCROP1BSR;         /* FLASH Bank PCROP area B Start address register,    Address offset: 0x34 */
    WORD32 dwPCROP1BER;         /* FLASH Bank PCROP area B End address register,      Address offset: 0x38 */
    WORD32 dwRESERVED3[17];     /* Reserved3,                                         Address offset: 0x3C */
    WORD32 dwSec;               /* FLASH security register ,                          Address offset: 0x80 */
}volatile *T_FTFA_MEM_MAP;

/* base address for map memory. */
#define FTFA_BASE_PTR                            ((T_FTFA_MEM_MAP)0x40022000UL)
#define FTFA_ACCCTRL_REG(base)                   ((base)->dwAccCtrlR)
#define FTFA_KEY_REG(base)                       ((base)->dwKeyR)
#define FTFA_OPTKEY_REG(base)                    ((base)->dwOptKeyR)
#define FTFA_ST_REG(base)                        ((base)->dwStR)
#define FTFA_CTRL_REG(base)                      ((base)->dwCtrlR)
#define FTFA_ECCR_REG(base)                      ((base)->dwEccR)
#define FTFA_OPTBYTE_REG(base)                   ((base)->dwOptByteR)
#define FTFA_PCROP1ASR_REG(base)                 ((base)->dwPCROP1ASR)
#define FTFA_PCROP1AER_REG(base)                 ((base)->dwPCROP1AER)
#define FTFA_WRTPRTA_REG(base)                   ((base)->dwWrtPrtAR)
#define FTFA_WRTPRTB_REG(base)                   ((base)->dwWrtPrtBR)
#define FTFA_PCROP1BSR_REG(base)                 ((base)->dwPCROP1BSR)
#define FTFA_PCROP1BER_REG(base)                 ((base)->dwPCROP1BER)

#define FTFA_ACCCTRL                             FTFA_ACCCTRL_REG(FTFA_BASE_PTR)
#define FTFA_KEY                                 FTFA_KEY_REG(FTFA_BASE_PTR)
#define FTFA_OPTKEY                              FTFA_OPTKEY_REG(FTFA_BASE_PTR)
#define FTFA_ST                                  FTFA_ST_REG(FTFA_BASE_PTR)
#define FTFA_CTRL                                FTFA_CTRL_REG(FTFA_BASE_PTR)
#define FTFA_ADDR                                FTFA_ADDR_REG(FTFA_BASE_PTR)
#define FTFA_OPTBYTE                             FTFA_OPTBYTE_REG(FTFA_BASE_PTR)
#define FTFA_WRTPRTA                             FTFA_WRTPRTA_REG(FTFA_BASE_PTR)
#define FTFA_WRTPRTB                             FTFA_WRTPRTB_REG(FTFA_BASE_PTR)
#define FTFA_ECCR                                FTFA_ECCR_REG(FTFA_BASE_PTR)

/* mask definition for register operation. */
#define FLASH_ACR_LATENCY_MASK                   0x00000007u  /* Latency */
#define FLASH_LATENCY_1                          0x01
#define FLASH_LATENCY_2                          0x02
#define FLASH_ACR_PRFTBS_MASK                    0x00000020u  /* Prefetch buffer status */
#define FLASH_ACR_PRFTBE_MASK                    0x00000010u  /* Prefetch buffer enable */
#define FLASH_ACR_HLFCYA_MASK                    0x00000008u  /* Flash half cycle access enable */

#define FLASH_ST_READY                           0x00
#define FLASH_ST_BUSY                            0x01


#define FTFA_CMD_ERASE_TIME                      40           /* flash erasing over time.    */
#define FTFA_CMD_WRITE_TIME                      10           /* flash programing over time. */


/******************  Bit definition for FLASH_KEYR register  ******************/
#define  FLASH_KEYR_FKEYR                    ((uint32_t)0xFFFFFFFF)        /* FPEC Key */

/*****************  Bit definition for FLASH_OPTKEYR register  ****************/
#define  FLASH_OPTKEYR_OPTKEYR               ((uint32_t)0xFFFFFFFF)        /* Option Byte Key */

/******************  FLASH Keys  **********************************************/
#define FLASH_KEY1                           ((uint32_t)0x45670123)        /* unlock key1 */
#define FLASH_KEY2                           ((uint32_t)0xCDEF89AB)        /* unlock key2 */
#define FLASH_RDPRT_KEY                      0x00A5                        /* read option unlock key */
                                                               
