dwgan/STKNX_ChargeStation/source/drivers/flash/STM32G0XXX/include/Stm32G0XX_Flash.h
#define FLASH_OPTKEY1                        ((uint32_t)0x45670123)        /* Flash option key1 */
#define FLASH_OPTKEY2                        ((uint32_t)0xCDEF89AB)        /* Flash option key2: used with FLASH_OPTKEY1 to
                                                                                unlock the write access to the option byte block */

/******************  Bit definition for FLASH_SR register  *******************/
#define  FLASH_SR_CFGBSY                     ((uint32_t)0x00040000)        /* Programming or erase configuration busy. */
#define  FLASH_SR_BSY                        ((uint32_t)0x00010000)        /* Busy                             */
#define  FLASH_SR_OPTVERR                    ((uint32_t)0x00008000)        /* Option and Engineering bits loading validity error */
#define  FLASH_SR_FASTERR                    ((uint32_t)0x00000200)        /* Fast programming error           */
#define  FLASH_SR_MISSERR                    ((uint32_t)0x00000100)        /* Fast programming data miss Error */
#define  FLASH_SR_PGSERR                     ((uint32_t)0x00000080)        /* programming sequence Error       */
#define  FLASH_SR_SIZEERR                    ((uint32_t)0x00000040)        /* size Error                       */
#define  FLASH_SR_PAGERR                     ((uint32_t)0x00000020)        /* programming alignment Error      */
#define  FLASH_SR_WRPRTERR                   ((uint32_t)0x00000010)        /* Write Protection Error           */
#define  FLASH_SR_PGERR                      ((uint32_t)0x00000008)        /* Programming Error                */
#define  FLASH_SR_OPERR                      ((uint32_t)0x00000002)        /* operation error                  */
#define  FLASH_SR_EOP                        ((uint32_t)0x00000001)        /* End of operation                 */
#define  FLASH_SR_WRPERR                     FLASH_SR_WRPRTERR             /* Legacy of Write Protection Error */

#define  FLASH_SR_ERR_MASK                   ((uint32_t)0x000083fa)

/*******************  Bit definition for FLASH_CR register  *******************/
#define  FLASH_CR_PG                         ((uint32_t)0x00000001)        /* Programming */
#define  FLASH_CR_PER                        ((uint32_t)0x00000002)        /* Page Erase  */
#define  FLASH_CR_MER                        ((uint32_t)0x00000004)        /* Mass Erase  */
#define  FLASH_CR_PAGE_NUM                   ((uint32_t)0x000001f8)        /* Page number */
#define  FLASH_CR_STRT                       ((uint32_t)0x00010000)        /* Start */
#define  FLASH_CR_OPTPG                      ((uint32_t)0x00020000)        /* Option Byte Programming */
#define  FLASH_CR_FAST_PRG                   ((uint32_t)0x00040000)        /* Fast programming.       */
#define  FLASH_CR_EOPIE                      ((uint32_t)0x01000000)        /* End of operation interrupt enable */
#define  FLASH_CR_ERRIE                      ((uint32_t)0x02000000)        /* Error interrupt enable            */
#define  FLASH_CR_OBL_LAUNCH                 ((uint32_t)0x08000000)        /* Forces the option byte loading    */
#define  FLASH_CR_OPT_LOCK                   ((uint32_t)0x40000000)        /* Options lock                      */
#define  FLASH_CR_LOCK                       ((uint32_t)0x80000000)        /* Lock                              */

/******************************* Flash ECCR Register ***************************/
#define  FLASH_ECCR_ADDR_MASK                ((uint32_t)0x00003fff)        /* address offset. */
#define  FLASH_ECCR_SYSF_ECC                 ((uint32_t)0x00100000)        /* System Flash memory ECC fail.    */
#define  FLASH_ECCR_ECCCIE                   ((uint32_t)0x01000000)        /* ECC correction interrupt enable. */
#define  FLASH_ECCR_ECCC                     ((uint32_t)0x40000000)        /* ECC correction.                  */
#define  FLASH_ECCR_ECCD                     ((uint32_t)0x80000000)        /* ECC detection.                   */

#define  FLASH_ECCR_ERR_MASK                 ((uint32_t)0xc0000000)
/*******************  Bit definition for FLASH_AR register  *******************/
#define  FLASH_AR_FAR                        ((uint32_t)0xFFFFFFFF)        /* Flash Address */


/******************************************************************************/
/*                                                                            */
/*                                    FLASH                                   */
/*                                                                            */
/******************************************************************************/
#define GPIO_NRST_CONFIG_SUPPORT         /*!< GPIO feature available only on specific devices: Configure NRST pin */
#define FLASH_SECURABLE_MEMORY_SUPPORT   /*!< Flash feature available only on specific devices: allow to secure memory */
#define FLASH_PCROP_SUPPORT              /*!< Flash feature available only on specific devices: proprietary code read protection areas selected by option */



/*******************  Bits definition for FLASH_SR register  ******************/
#define FLASH_SR_EOP_Pos                       (0U)
#define FLASH_SR_EOP_Msk                       (0x1UL << FLASH_SR_EOP_Pos)      /*!< 0x00000001 */
#define FLASH_SR_OPERR_Pos                     (1U)
#define FLASH_SR_OPERR_Msk                     (0x1UL << FLASH_SR_OPERR_Pos)    /*!< 0x00000002 */
#define FLASH_SR_PROGERR_Pos                   (3U)
#define FLASH_SR_PROGERR_Msk                   (0x1UL << FLASH_SR_PROGERR_Pos)  /*!< 0x00000008 */
#define FLASH_SR_PROGERR                       FLASH_SR_PROGERR_Msk
#define FLASH_SR_WRPERR_Pos                    (4U)
#define FLASH_SR_WRPERR_Msk                    (0x1UL << FLASH_SR_WRPERR_Pos)   /*!< 0x00000010 */
#define FLASH_SR_PGAERR_Pos                    (5U)
#define FLASH_SR_PGAERR_Msk                    (0x1UL << FLASH_SR_PGAERR_Pos)   /*!< 0x00000020 */
#define FLASH_SR_PGAERR                        FLASH_SR_PGAERR_Msk
#define FLASH_SR_SIZERR_Pos                    (6U)
#define FLASH_SR_SIZERR_Msk                    (0x1UL << FLASH_SR_SIZERR_Pos)   /*!< 0x00000040 */
#define FLASH_SR_SIZERR                        FLASH_SR_SIZERR_Msk
#define FLASH_SR_PGSERR_Pos                    (7U)
#define FLASH_SR_PGSERR_Msk                    (0x1UL << FLASH_SR_PGSERR_Pos)   /*!< 0x00000080 */
#define FLASH_SR_MISERR_Pos                    (8U)
#define FLASH_SR_MISERR_Msk                    (0x1UL << FLASH_SR_MISERR_Pos)   /*!< 0x00000100 */
#define FLASH_SR_MISERR                        FLASH_SR_MISERR_Msk
#define FLASH_SR_FASTERR_Pos                   (9U)
#define FLASH_SR_FASTERR_Msk                   (0x1UL << FLASH_SR_FASTERR_Pos)  /*!< 0x00000200 */
#define FLASH_SR_RDERR_Pos                     (14U)
#define FLASH_SR_RDERR_Msk                     (0x1UL << FLASH_SR_RDERR_Pos)    /*!< 0x00004000 */
#define FLASH_SR_RDERR                         FLASH_SR_RDERR_Msk
#define FLASH_SR_OPTVERR_Pos                   (15U)
#define FLASH_SR_OPTVERR_Msk                   (0x1UL << FLASH_SR_OPTVERR_Pos)  /*!< 0x00008000 */
#define FLASH_SR_BSY1_Pos                      (16U)
#define FLASH_SR_BSY1_Msk                      (0x1UL << FLASH_SR_BSY1_Pos)     /*!< 0x00010000 */
#define FLASH_SR_BSY1                          FLASH_SR_BSY1_Msk
#define FLASH_SR_CFGBSY_Pos                    (18U)
#define FLASH_SR_CFGBSY_Msk                    (0x1UL << FLASH_SR_CFGBSY_Pos)   /*!< 0x00040000 */

